

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int a = 1, b = 2, c = 3, d = 0, e = 0, f = 0, g = 0, h = 0, i = 0, j = 0;
	cout << "\na = 1 ,b = 2, c = 3 ";
	cout << "\nd = a++ + b++ + c++; ";
	d = a++ + b++ + c++;
	cout << "\na = " << a << "\nb = " << b << "\nc = " << c << "\nd = " << d;
	cout << "\n\ne = a-- + b-- + c--;";
	e = a-- + b-- + c--;
	cout << "\na = " << a << "\nb = " << b << "\nc = " << c << "\ne = " << e;
	cout << "\n\nf = --a + ++b + c--;";
	f = --a + ++b + c--;
	cout << "\na = " << a << "\nb = " << b << "\nc = " << c << "\nf = " << f;
	cout << "\n\ng = ++a + --b + --c;";
	g = ++a + --b + --c;
	cout << "\na = " << a << "\nb = " << b << "\nc = " << c << "\ng = " << g;
	cout << "\n\nh = d++ + ++e + ++f + g--;";
	h = d++ + ++e + ++f + g--;
	cout << "\nd = " << d << "\ne = " << e << "\nf = " << f << "\ng = " << g << "\nh = " << h;
	cout << "\n\ni = --d + --e + --f + --g;";
	i = --d + --e + --f + --g;
	cout << "\nd = " << d << "\ne = " << e << "\nf = " << f << "\ng = " << g << "\ni = " << i;
	cout << "\n\nj = h++ + ++i;";
	j = h++ + ++i;
	cout << "\nh = " << h << "\ni = " << i << "\nj = " << j;
	cout << "\n\na = " << a;
	cout << "\nb = " << b;
	cout << "\nc = " << c;
	cout << "\nd = " << d;
	cout << "\ne = " << e;
	cout << "\nf = " << f;
	cout << "\ng = " << g;
	cout << "\nh = " << h;
	cout << "\ni = " << i;
	cout << "\nj = " << j;
	cout << "\n\n По правде говоря,не считаю что тут нужно каждый раз объяснять,\n что происходит с переменными,я попробую объяснить за 1 раз";
	cout << "\n\n Суть в том, что когда знаки ++ или -- стоят после переменной в примере,\n то сначала пример посчитается с исходными значениями переменных,а уже после того, \n как пример просчитается, переменные получат +1 или -1, и наоборот, если знаки ++ или -- стоят \n перед переменной, то сначала изменится значения переменной,а уже потом посчитается пример";



}

